[
    {
    "name": "The Honorable Benjamin L. Cardin",
    "title": "Former U.S. Senator & Chair, Senate Foreign Relations Committee | Human Rights Champion | Distinguished Statesman",
    "image": "images/team/18.jpeg",
    "quote": "Reclaiming Respect requires responsible civic engagement by everyone. Responsible civic engagement requires an informed constituency that participates in civil discourse, listening to those who may have different views in an effort to create a broader consensus for a fairer and more peaceful community."
  },
  {
    "name": "Martin Cooper",
    "title": "The Father of the Cell Phone, Inventor & Wireless Communications Pioneer",
    "image": "images/team/2.jpeg",
    "quote": "Survival of our civilization is, for the first time, dependent upon a lasting peace based upon universal principles of mutual respect and rational behavior. War is no longer an acceptable means for resolving disputes if for no reason other than that the weapons of warfare are no longer controllable. No one will win the next big war."
  },
    {
    "name": "Janice M. Perlman",
    "title": "Educator & Consultant to Maryland State Department of Education | Peace Advocate | UNITAR Diplomatic Immersion Programs (The Hague & Geneva) | Partner in Peace Across 46 Nations",
    "image": "images/team/10.jpeg",
    "quote": "As Manny’s partner across 46 countries and 50 years of peacebuilding, I’ve learned that respect is the universal language every heart understands. My work as a Maryland State Education Consultant taught me that transformation begins in classrooms. From palaces to poverty, when you honor dignity, people flourish. Our UNITAR studies in The Hague and Geneva confirmed what experience proved: peace grows from genuine relationships and unwavering respect. Reclaiming Respect distills Manny’s five decades of practical wisdom."
  },
  {
    "name": "Marion Blumenthal Lazan",
    "title": "Holocaust Survivor, International Human Rights Advocate",
    "image": "images/team/1.jpeg",
    "quote": "In order to achieve and sustain peace in our fragile world, we must reunite to RECLAIM RESPECT, compassion, and kindness towards one another. Having lived in a world void of compassion and respect, this publication will give its readers the tools to be reminded to live by these important attributes."
  },
  {
    "name": "C.J. Johnson, Ph.D.",
    "title": "Strategic International Negotiator | Architect of Botswana’s Economic Transformation | Expert in Peacebuilding Through Prosperity",
    "image": "images/team/3.jpeg",
    "quote": "Drawing on a lifetime of global experiences and his strong ethical and moral foundations, he has written Reclaiming Respect that examines the fraying threads of American society and democracy. In it, he shares his insights on fostering respect and peace, transcending national borders and political frameworks."
  },
  {
    "name": "Naila Chowdhury",
    "title": "Global Social Impact Leader & Peacebuilder | Co-Founder & Chair, The Alliance 4 Empowerment | Founder, Women4Empowerment",
    "image": "images/team/4.jpeg",
    "quote": "This book is more than literature, it is a spiritual transmission, a peace offering to a world desperately seeking healing and transformation."
  },
  {
    "name": "Dr. Suresh Subramani, Ph.D.",
    "title": "Global Director, Tata Institute for Genetics and Society | Tata Chancellor’s Endowed Professor | Distinguished Professor of Molecular Biology, UC San Diego",
    "image": "images/team/5.jpeg",
    "quote": "Manny has poured his heart and soul into his new book “Reclaiming Respect” describing his passion and journey in his quest for Peace as a necessary destination. Every reader who reads his book and resonates with his message will be inspired to do their bit to achieve this goal."
  },
  {
    "name": "Dr. Paul J. Mills, Ph.D.",
    "title": "Professor of Family Medicine & Public Health, UC San Diego | Chief, Division of Behavioral Medicine | Director, Center of Excellence for Research & Training in Integrative Health | Director of Research, Chopra Foundation",
    "image": "images/team/6.jpeg",
    "quote": "Among the many chapters in his book, I found the message of chapter 'Small Acts, Lasting Peace' particularly inspiring because it shows us how simple it is to start on this path, that even small acts of offering respect can not only immediately transform an individual life, but also eventually an entire community."
  },
  {
    "name": "Dr. Everett R. Siegel, M.D.",
    "title": "Retired Assistant Professor of Psychiatry & Behavioral Sciences, Johns Hopkins | Director of Student Mental Health Certified Psychoanalyst | Director of Psychodynamic Psychotherapy Curriculum",
    "image": "images/team/7.jpeg",
    "quote": "Manny has built bridges by meeting diverse people and sharing their stories, through his foundation, Destination Peace, and through music. These actions are about being and community. I’ve said he deserves the Nobel Peace Prize."
  },
  {
    "name": "Arlene Harris",
    "title": "The First Lady of Wireless Technology | Pioneer of Accessible Communications | Technology Entrepreneur & Humanitarian",
    "image": "images/team/8.jpeg",
    "quote": "As someone who loves Manny for his relentless ambassadorship for peace, I can hardly wait to read his book and lay my eyes on his cinema. Whether through his music or stories or advocacies, he has become a great spiritual leader of our time."
  },
  {
    "name": "Rabih El-Haddad",
    "title": "Director of Multilateral Diplomacy Division | United Nations Institute for Training and Research",
    "image": "images/team/9.jpeg",
    "quote": "Positive peace today is not a theoretical notion; it requires action and a constant effort by inspirational advocates like Manny. Real peace is a slow construction that prospers through silent sacrifice and pain. Dreamers like Manny remind us that both war and peace have a price and that it is always better to pay the price for peace."
  },
  {
    "name": "Dr. Barry Sandrew",
    "title": "Visionary Neuroscientist & Digital Pioneer | Revolutionary Entrepreneur | Director of Entrepreneurship, Westcliff University | Inventor of 2D-to-3D Conversion Technology",
    "image": "images/team/11.jpeg",
    "quote": "This profound book… is both a legacy of wisdom and an urgent invitation to build dignity across generations. Innovation reshapes our world through vibrant visuals or mentoring bold dreamers. Progress demands courage and a commitment to humanity’s creativity."
  },
   {
    "name": "Professor William Riley",
    "title": "Master Voice Teacher & Classical Baritone | International Authority on Vocal Excellence | Consultant to The Metropolitan Opera & The White House",
    "image": "images/team/12.jpeg",
    "quote": "Many authors today strive to point out the failures of society, the justification of greed in the pursuit of oligarchy, knighthood or other political/social favoritism, and the self-servingly evil motives of virtually every movement or party active in the current societies of the planet."
  },
    {
    "name": "Dr. Richard Levin, Ed.D.",
    "title": "Pioneer of Executive Coaching | Architect of Leadership Transformation | Visionary in Organizational Excellence",
    "image": "images/team/13.jpeg",
    "quote": "Manny’s outstanding book and his ongoing meetings, conversations, and angelic voice, will continue to have a powerful and deeply meaningful impact on moving the world toward peace. You will experience that feeling yourself as you read this exceptional book. It will motivate and inspire you to walk side by side with Manny on a heavenly journey of peace."
  },
   {
    "name": "Chukwuma Ephraim Okenwa",
    "title": "School Director & Educational Visionary | Executive Director, LEAD Network Africa | Author & Governance Advocate | Ambassador, Destination Peace",
    "image": "images/team/14.jpeg",
    "quote": "To build harmony and mitigate violent conflict, we must first cultivate peace within ourselves. This makes the role of peacebuilders, parents, teachers, clergymen, or community leaders indispensable."
  },
   {
    "name": "Dr. Allan Yozawitz, Ph.D., ABPP",
    "title": "Pioneering Clinical Neuropsychologist | Fellow, American Psychological Association | Board-Certified Specialist",
    "image": "images/team/15.jpeg",
    "quote": "Emanuel Perlman has obtained insight through his experience effectively communicating with people through music around the globe, to provide us with a roadmap for how to accomplish this vital task. Therefore, his book entitled ‘Reclaiming Respect’ is a must read for everyone."
  },
    {
    "name": "A. Peyson Hunt",
    "title": "Senior Visiting Research Fellow, Cambodian Center for Regional Studies | Research Lead, US-ASEAN Young Professionals Association | International Relations Scholar & Peace-Building Strategist",
    "image": "images/team/16.jpeg",
    "quote": "Reclaiming Respect encapsulates the foundation for how we engage with others across every facet of life… To me, Reclaiming Respect is not just about civility, it is about finding the intersection of cooperation and peace where anything is possible."
  },
    {
    "name": "Dr. Nicholas Beecroft",
    "title": "Distinguished Military and Organizational Psychiatrist | Member, Royal College of Defense Studies",
    "image": "images/team/17.jpeg",
    "quote": "Peace flows when we integrate the best of all worldviews, direct perception and instinct, the safety of family and tribe, the courage of warriors, the order of law, institutions and morality, the compassion of caregivers, the creativity of innovators, the effectiveness of leadership, and the wisdom of elders into a higher harmony that serves the common good."
  },
    {
    "name": "Stacey Hovis",
    "title": "Creative Storyteller | Film & Television Content Producer",
    "image": "images/team/1.jpg",
    "quote": "Mr. Perlman what a wonderful gift that you have given to the world with your wonderful book! Many thanks."
  }

]
